GopalSaraf/Practicals/PSDL/include/proc/pic18f25j50.inc
// Register: PCL
#define PCL PCL
PCL                                      equ 0FF9h
// bitfield definitions
PCL_PCL_POSN                             equ 0000h
PCL_PCL_POSITION                         equ 0000h
PCL_PCL_SIZE                             equ 0008h
PCL_PCL_LENGTH                           equ 0008h
PCL_PCL_MASK                             equ 00FFh

// Register: PCLATH
#define PCLATH PCLATH
PCLATH                                   equ 0FFAh
// bitfield definitions
PCLATH_PCH_POSN                          equ 0000h
PCLATH_PCH_POSITION                      equ 0000h
PCLATH_PCH_SIZE                          equ 0008h
PCLATH_PCH_LENGTH                        equ 0008h
PCLATH_PCH_MASK                          equ 00FFh

// Register: PCLATU
#define PCLATU PCLATU
PCLATU                                   equ 0FFBh

// Register: STKPTR
#define STKPTR STKPTR
STKPTR                                   equ 0FFCh
// bitfield definitions
STKPTR_STKPTR_POSN                       equ 0000h
STKPTR_STKPTR_POSITION                   equ 0000h
STKPTR_STKPTR_SIZE                       equ 0005h
STKPTR_STKPTR_LENGTH                     equ 0005h
STKPTR_STKPTR_MASK                       equ 001Fh
STKPTR_STKUNF_POSN                       equ 0006h
STKPTR_STKUNF_POSITION                   equ 0006h
STKPTR_STKUNF_SIZE                       equ 0001h
STKPTR_STKUNF_LENGTH                     equ 0001h
STKPTR_STKUNF_MASK                       equ 0040h
STKPTR_STKFUL_POSN                       equ 0007h
STKPTR_STKFUL_POSITION                   equ 0007h
STKPTR_STKFUL_SIZE                       equ 0001h
STKPTR_STKFUL_LENGTH                     equ 0001h
STKPTR_STKFUL_MASK                       equ 0080h
STKPTR_SP0_POSN                          equ 0000h
STKPTR_SP0_POSITION                      equ 0000h
STKPTR_SP0_SIZE                          equ 0001h
STKPTR_SP0_LENGTH                        equ 0001h
STKPTR_SP0_MASK                          equ 0001h
STKPTR_SP1_POSN                          equ 0001h
STKPTR_SP1_POSITION                      equ 0001h
STKPTR_SP1_SIZE                          equ 0001h
STKPTR_SP1_LENGTH                        equ 0001h
STKPTR_SP1_MASK                          equ 0002h
STKPTR_SP2_POSN                          equ 0002h
STKPTR_SP2_POSITION                      equ 0002h
STKPTR_SP2_SIZE                          equ 0001h
STKPTR_SP2_LENGTH                        equ 0001h
STKPTR_SP2_MASK                          equ 0004h
STKPTR_SP3_POSN                          equ 0003h
STKPTR_SP3_POSITION                      equ 0003h
STKPTR_SP3_SIZE                          equ 0001h
STKPTR_SP3_LENGTH                        equ 0001h
STKPTR_SP3_MASK                          equ 0008h
STKPTR_SP4_POSN                          equ 0004h
STKPTR_SP4_POSITION                      equ 0004h
STKPTR_SP4_SIZE                          equ 0001h
STKPTR_SP4_LENGTH                        equ 0001h
STKPTR_SP4_MASK                          equ 0010h
STKPTR_STKOVF_POSN                       equ 0007h
STKPTR_STKOVF_POSITION                   equ 0007h
STKPTR_STKOVF_SIZE                       equ 0001h
STKPTR_STKOVF_LENGTH                     equ 0001h
STKPTR_STKOVF_MASK                       equ 0080h

// Register: TOS
#define TOS TOS
TOS                                      equ 0FFDh

// Register: TOSL
#define TOSL TOSL
TOSL                                     equ 0FFDh
// bitfield definitions
TOSL_TOSL_POSN                           equ 0000h
TOSL_TOSL_POSITION                       equ 0000h
TOSL_TOSL_SIZE                           equ 0008h
TOSL_TOSL_LENGTH                         equ 0008h
TOSL_TOSL_MASK                           equ 00FFh

// Register: TOSH
#define TOSH TOSH
TOSH                                     equ 0FFEh
// bitfield definitions
TOSH_TOSH_POSN                           equ 0000h
TOSH_TOSH_POSITION                       equ 0000h
TOSH_TOSH_SIZE                           equ 0008h
TOSH_TOSH_LENGTH                         equ 0008h
TOSH_TOSH_MASK                           equ 00FFh

// Register: TOSU
#define TOSU TOSU
TOSU                                     equ 0FFFh

/*
 * Bit Access Macros
 */

#ifndef PAGEMASK
#define PAGEMASK(addr) ((addr) and 0FFFFFh)
#endif
#ifndef BANKMASK
#define BANKMASK(addr) ((addr) and 0FFh)
#endif
#define ABDEN                            BANKMASK(BAUDCON1), 0, a
#define ABDEN1                           BANKMASK(BAUDCON1), 0, a
#define ABDEN2                           BANKMASK(BAUDCON2), 0, a
#define ABDOVF                           BANKMASK(BAUDCON1), 7, a
#define ABDOVF1                          BANKMASK(BAUDCON1), 7, a
#define ABDOVF2                          BANKMASK(BAUDCON2), 7, a
#define ACKDT                            BANKMASK(SSP1CON2), 5, a
#define ACKDT1                           BANKMASK(SSP1CON2), 5, a
#define ACKDT2                           BANKMASK(SSP2CON2), 5, a
#define ACKEN                            BANKMASK(SSP1CON2), 4, a
#define ACKEN1                           BANKMASK(SSP1CON2), 4, a
#define ACKEN2                           BANKMASK(SSP2CON2), 4, a
#define ACKSTAT                          BANKMASK(SSP1CON2), 6, a
#define ACKSTAT1                         BANKMASK(SSP1CON2), 6, a
#define ACKSTAT2                         BANKMASK(SSP2CON2), 6, a
#define ACQT0                            BANKMASK(ADCON1), 3, a
#define ACQT1                            BANKMASK(ADCON1), 4, a
#define ACQT2                            BANKMASK(ADCON1), 5, a
#define ACTVIE                           BANKMASK(UIE), 2, b
#define ACTVIF                           BANKMASK(UIR), 2, a
#define ADCAL                            BANKMASK(ADCON1), 6, a
#define ADCS0                            BANKMASK(ADCON1), 0, a
#define ADCS1                            BANKMASK(ADCON1), 1, a
#define ADCS2                            BANKMASK(ADCON1), 2, a
#define ADDEN                            BANKMASK(RCSTA1), 3, a
#define ADDEN1                           BANKMASK(RCSTA1), 3, a
#define ADDEN2                           BANKMASK(RCSTA2), 3, a
#define ADDR0                            BANKMASK(UADDR), 0, b
#define ADDR1                            BANKMASK(UADDR), 1, b
#define ADDR2                            BANKMASK(UADDR), 2, b
#define ADDR3                            BANKMASK(UADDR), 3, b
#define ADDR4                            BANKMASK(UADDR), 4, b
#define ADDR5                            BANKMASK(UADDR), 5, b
#define ADDR6                            BANKMASK(UADDR), 6, b
#define ADEN                             BANKMASK(RCSTA1), 3, a
#define ADFM                             BANKMASK(ADCON1), 7, a
#define ADIE                             BANKMASK(PIE1), 6, a
#define ADIF                             BANKMASK(PIR1), 6, a
#define ADIP                             BANKMASK(IPR1), 6, a
#define ADMSK1                           BANKMASK(SSP1CON2), 1, a
#define ADMSK11                          BANKMASK(SSP1CON2), 1, a
#define ADMSK12                          BANKMASK(SSP2CON2), 1, a
#define ADMSK2                           BANKMASK(SSP1CON2), 2, a
#define ADMSK21                          BANKMASK(SSP1CON2), 2, a
#define ADMSK22                          BANKMASK(SSP2CON2), 2, a
#define ADMSK3                           BANKMASK(SSP1CON2), 3, a
#define ADMSK31                          BANKMASK(SSP1CON2), 3, a
#define ADMSK32                          BANKMASK(SSP2CON2), 3, a
#define ADMSK4                           BANKMASK(SSP1CON2), 4, a
#define ADMSK41                          BANKMASK(SSP1CON2), 4, a
#define ADMSK42                          BANKMASK(SSP2CON2), 4, a
#define ADMSK5                           BANKMASK(SSP1CON2), 5, a
#define ADMSK51                          BANKMASK(SSP1CON2), 5, a
#define ADMSK52                          BANKMASK(SSP2CON2), 5, a
#define ADON                             BANKMASK(ADCON0), 0, a
#define ALRMEN                           BANKMASK(ALRMCFG), 7, a
#define ALRMPTR0                         BANKMASK(ALRMCFG), 0, a
#define ALRMPTR1                         BANKMASK(ALRMCFG), 1, a
#define AMASK0                           BANKMASK(ALRMCFG), 2, a
#define AMASK1                           BANKMASK(ALRMCFG), 3, a
#define AMASK2                           BANKMASK(ALRMCFG), 4, a
#define AMASK3                           BANKMASK(ALRMCFG), 5, a
#define AN0                              BANKMASK(PORTA), 0, a
#define AN1                              BANKMASK(PORTA), 1, a
#define AN10                             BANKMASK(PORTB), 1, a
#define AN11                             BANKMASK(PORTC), 2, a
#define AN12                             BANKMASK(PORTB), 0, a
#define AN2                              BANKMASK(PORTA), 2, a
#define AN3                              BANKMASK(PORTA), 3, a
#define AN4                              BANKMASK(PORTA), 5, a
#define AN8                              BANKMASK(PORTB), 2, a
#define AN9                              BANKMASK(PORTB), 3, a
#define ARPT0                            BANKMASK(ALRMRPT), 0, a
#define ARPT1                            BANKMASK(ALRMRPT), 1, a
#define ARPT2                            BANKMASK(ALRMRPT), 2, a
#define ARPT3                            BANKMASK(ALRMRPT), 3, a
#define ARPT4                            BANKMASK(ALRMRPT), 4, a
#define ARPT5                            BANKMASK(ALRMRPT), 5, a
#define ARPT6                            BANKMASK(ALRMRPT), 6, a
#define ARPT7                            BANKMASK(ALRMRPT), 7, a
#define BCL1IE                           BANKMASK(PIE2), 3, a
#define BCL1IF                           BANKMASK(PIR2), 3, a
#define BCL1IP                           BANKMASK(IPR2), 3, a
#define BCL2IE                           BANKMASK(PIE3), 6, a
#define BCL2IF                           BANKMASK(PIR3), 6, a
#define BCL2IP                           BANKMASK(IPR3), 6, a
#define BCLIE                            BANKMASK(PIE2), 3, a
#define BCLIF                            BANKMASK(PIR2), 3, a
#define BCLIP                            BANKMASK(IPR2), 3, a
#define BF                               BANKMASK(SSP1STAT), 0, a
#define BF1                              BANKMASK(SSP1STAT), 0, a
#define BF2                              BANKMASK(SSP2STAT), 0, a
#define BGVST                            BANKMASK(HLVDCON), 6, a
#define BOR                              BANKMASK(RCON), 0, a
#define BRG16                            BANKMASK(BAUDCON1), 3, a
#define BRG161                           BANKMASK(BAUDCON1), 3, a
#define BRG162                           BANKMASK(BAUDCON2), 3, a
#define BRGH                             BANKMASK(TXSTA1), 2, a
#define BRGH1                            BANKMASK(TXSTA1), 2, a
#define BRGH2                            BANKMASK(TXSTA2), 2, a
#define BTOEE                            BANKMASK(UEIE), 4, b
#define BTOEF                            BANKMASK(UEIR), 4, a
#define BTSEE                            BANKMASK(UEIE), 7, b
#define BTSEF                            BANKMASK(UEIR), 7, a
#define C1CH0                            BANKMASK(CM1CON), 0, a
#define C1CH1                            BANKMASK(CM1CON), 1, a
#define C1INA                            BANKMASK(PORTA), 0, a
#define C1INB                            BANKMASK(PORTA), 3, a
#define C2INA                            BANKMASK(PORTA), 1, a
#define C2INB                            BANKMASK(PORTA), 2, a
#define CAL0                             BANKMASK(RTCCAL), 0, b
#define CAL1                             BANKMASK(RTCCAL), 1, b
#define CAL2                             BANKMASK(RTCCAL), 2, b
#define CAL3                             BANKMASK(RTCCAL), 3, b
#define CAL4                             BANKMASK(RTCCAL), 4, b
#define CAL5                             BANKMASK(RTCCAL), 5, b
#define CAL6                             BANKMASK(RTCCAL), 6, b
#define CAL7                             BANKMASK(RTCCAL), 7, b
#define CARRY                            BANKMASK(STATUS), 0, a
#define CCH0                             BANKMASK(CM1CON), 0, a
#define CCH01                            BANKMASK(CM1CON), 0, a
#define CCH02                            BANKMASK(CM2CON), 0, a
#define CCH1                             BANKMASK(CM1CON), 1, a
#define CCH11                            BANKMASK(CM1CON), 1, a
#define CCH12                            BANKMASK(CM2CON), 1, a
#define CCP1IE                           BANKMASK(PIE1), 2, a
#define CCP1IF                           BANKMASK(PIR1), 2, a
#define CCP1IP                           BANKMASK(IPR1), 2, a
#define CCP1M0                           BANKMASK(CCP1CON), 0, a
#define CCP1M1                           BANKMASK(CCP1CON), 1, a
#define CCP1M2                           BANKMASK(CCP1CON), 2, a
#define CCP1M3                           BANKMASK(CCP1CON), 3, a
#define CCP1X                            BANKMASK(CCP1CON), 5, a
#define CCP1Y                            BANKMASK(CCP1CON), 4, a
#define CCP2                             BANKMASK(PORTC), 1, a
#define CCP2IE                           BANKMASK(PIE2), 0, a
#define CCP2IF                           BANKMASK(PIR2), 0, a
#define CCP2IP                           BANKMASK(IPR2), 0, a
#define CCP2M0                           BANKMASK(CCP2CON), 0, a
#define CCP2M1                           BANKMASK(CCP2CON), 1, a
#define CCP2M2                           BANKMASK(CCP2CON), 2, a
#define CCP2M3                           BANKMASK(CCP2CON), 3, a
#define CCP2X                            BANKMASK(CCP2CON), 5, a
#define CCP2Y                            BANKMASK(CCP2CON), 4, a
#define CCP2_PA2                         BANKMASK(PORTB), 3, a
#define CHIME                            BANKMASK(ALRMCFG), 6, a
#define CHS0                             BANKMASK(ADCON0), 2, a
#define CHS1                             BANKMASK(ADCON0), 3, a
#define CHS2                             BANKMASK(ADCON0), 4, a
#define CHS3                             BANKMASK(ADCON0), 5, a
#define CHSN3                            BANKMASK(ADCON1), 3, a
#define CK1                              BANKMASK(PORTC), 6, a
#define CKE                              BANKMASK(SSP1STAT), 6, a
#define CKE1                             BANKMASK(SSP1STAT), 6, a
#define CKE2                             BANKMASK(SSP2STAT), 6, a
#define CKP                              BANKMASK(SSP1CON1), 4, a
#define CKP1                             BANKMASK(SSP1CON1), 4, a
#define CKP2                             BANKMASK(SSP2CON1), 4, a
#define CKTXP                            BANKMASK(BAUDCON1), 4, a
#define CLKI                             BANKMASK(PORTA), 7, a
#define CLKO                             BANKMASK(PORTA), 6, a
#define CM                               BANKMASK(RCON), 5, a
#define CM1IE                            BANKMASK(PIE2), 5, a
#define CM1IF                            BANKMASK(PIR2), 5, a
#define CM1IP                            BANKMASK(IPR2), 5, a
#define CM2IE                            BANKMASK(PIE2), 6, a
#define CM2IF                            BANKMASK(PIR2), 6, a
#define CM2IP                            BANKMASK(IPR2), 6, a
#define CMIE                             BANKMASK(PIE2), 6, a
#define CMIF                             BANKMASK(PIR2), 6, a
#define CMIP                             BANKMASK(IPR2), 6, a
#define CMPL0                            BANKMASK(PSTR1CON), 6, a
#define CMPL02                           BANKMASK(PSTR2CON), 6, a
#define CMPL1                            BANKMASK(PSTR1CON), 7, a
#define CMPL12                           BANKMASK(PSTR2CON), 7, a
#define COE                              BANKMASK(CM1CON), 6, a
#define COE1                             BANKMASK(CM1CON), 6, a
#define COE2                             BANKMASK(CM2CON), 6, a
#define CON                              BANKMASK(CM1CON), 7, a
#define CON1                             BANKMASK(CM1CON), 7, a
#define CON2                             BANKMASK(CM2CON), 7, a
#define COUT1                            BANKMASK(CMSTAT), 0, a
#define COUT2                            BANKMASK(CMSTAT), 1, a
#define CPOL                             BANKMASK(CM1CON), 5, a
#define CPOL1                            BANKMASK(CM1CON), 5, a
#define CPOL2                            BANKMASK(CM2CON), 5, a
#define CRC16EE                          BANKMASK(UEIE), 2, b
#define CRC16EF                          BANKMASK(UEIR), 2, a
#define CRC5EE                           BANKMASK(UEIE), 1, b
#define CRC5EF                           BANKMASK(UEIR), 1, a
#define CREF                             BANKMASK(CM1CON), 2, a
#define CREF1                            BANKMASK(CM1CON), 2, a
#define CREF2                            BANKMASK(CM2CON), 2, a
#define CREN                             BANKMASK(RCSTA1), 4, a
#define CREN1                            BANKMASK(RCSTA1), 4, a
#define CREN2                            BANKMASK(RCSTA2), 4, a
#define CSRC                             BANKMASK(TXSTA1), 7, a
#define CSRC1                            BANKMASK(TXSTA1), 7, a
#define CSRC2                            BANKMASK(TXSTA2), 7, a
#define CTEDG1                           BANKMASK(PORTB), 2, a
#define CTEDG2                           BANKMASK(PORTB), 3, a
#define CTMUEN                           BANKMASK(CTMUCONH), 7, a
#define CTMUIE                           BANKMASK(PIE3), 2, a
#define CTMUIF                           BANKMASK(PIR3), 2, a
#define CTMUIP                           BANKMASK(IPR3), 2, a
#define CTMUSIDL                         BANKMASK(CTMUCONH), 5, a
#define CTPLS                            BANKMASK(PORTC), 2, a
#define CTTRIG                           BANKMASK(CTMUCONH), 0, a
#define CVR0                             BANKMASK(CVRCON), 0, b
#define CVR1                             BANKMASK(CVRCON), 1, b
#define CVR2                             BANKMASK(CVRCON), 2, b
#define CVR3                             BANKMASK(CVRCON), 3, b
#define CVREF_MINUS                      BANKMASK(PORTA), 2, a
#define CVREN                            BANKMASK(CVRCON), 7, b
#define CVROE                            BANKMASK(CVRCON), 6, b
#define CVROEN                           BANKMASK(CVRCON), 6, b
#define CVRR                             BANKMASK(CVRCON), 5, b
#define CVRSS                            BANKMASK(CVRCON), 4, b
#define D1                               BANKMASK(SSP1STAT), 5, a
#define DA                               BANKMASK(SSP1STAT), 5, a
#define DA1                              BANKMASK(SSP1STAT), 5, a
#define DA2                              BANKMASK(SSP2STAT), 5, a
#define DATA_ADDRESS                     BANKMASK(SSP1STAT), 5, a
#define DATA_ADDRESS1                    BANKMASK(SSP1STAT), 5, a
#define DATA_ADDRESS2                    BANKMASK(SSP2STAT), 5, a
#define DC                               BANKMASK(STATUS), 1, a
#define DC1B0                            BANKMASK(CCP1CON), 4, a
#define DC1B1                            BANKMASK(CCP1CON), 5, a
#define DC2B0                            BANKMASK(CCP2CON), 4, a
#define DC2B1                            BANKMASK(CCP2CON), 5, a
#define DFN8EE                           BANKMASK(UEIE), 3, b
#define DFN8EF                           BANKMASK(UEIR), 3, a
#define DIR                              BANKMASK(USTAT), 2, a
#define DLYCYC0                          BANKMASK(DMACON2), 4, a
#define DLYCYC1                          BANKMASK(DMACON2), 5, a
#define DLYCYC2                          BANKMASK(DMACON2), 6, a
#define DLYCYC3                          BANKMASK(DMACON2), 7, a
#define DLYINTEN                         BANKMASK(DMACON1), 1, a
#define DMAEN                            BANKMASK(DMACON1), 0, a
#define DONE                             BANKMASK(ADCON0), 1, a
#define DSBOR                            BANKMASK(DSCONL), 1, b
#define DSEN                             BANKMASK(DSCONH), 7, b
#define DSFLT                            BANKMASK(DSWAKEL), 7, b
#define DSINT0                           BANKMASK(DSWAKEH), 0, b
#define DSMCLR                           BANKMASK(DSWAKEL), 2, b
#define DSPOR                            BANKMASK(DSWAKEL), 0, b
#define DSRTC                            BANKMASK(DSWAKEL), 3, b
#define DSULP                            BANKMASK(DSWAKEL), 5, b
#define DSULPEN                          BANKMASK(DSCONH), 1, b
#define DSWDT                            BANKMASK(DSWAKEL), 4, b
#define DT1                              BANKMASK(PORTC), 7, a
#define DTRXP                            BANKMASK(BAUDCON1), 5, a
#define DTRXP1                           BANKMASK(BAUDCON1), 5, a
#define DTRXP2                           BANKMASK(BAUDCON2), 5, a
#define DUPLEX0                          BANKMASK(DMACON1), 2, a
#define DUPLEX1                          BANKMASK(DMACON1), 3, a
#define D_A                              BANKMASK(SSP1STAT), 5, a
#define D_A1                             BANKMASK(SSP1STAT), 2, a
#define D_A2                             BANKMASK(SSP2STAT), 5, a
#define D_MINUS                          BANKMASK(PORTC), 4, a
#define D_NOT_A1                         BANKMASK(SSP1STAT), 5, a
#define D_NOT_A2                         BANKMASK(SSP2STAT), 5, a
#define D_PLUS                           BANKMASK(PORTC), 5, a
#define D_nA                             BANKMASK(SSP1STAT), 5, a
#define D_nA1                            BANKMASK(SSP1STAT), 5, a
#define D_nA2                            BANKMASK(SSP2STAT), 5, a
#define EBDIS                            BANKMASK(PR2), 7, a
#define ECCP1AS0                         BANKMASK(ECCP1AS), 4, a
#define ECCP1AS1                         BANKMASK(ECCP1AS), 5, a
#define ECCP1AS2                         BANKMASK(ECCP1AS), 6, a
#define ECCP1ASE                         BANKMASK(ECCP1AS), 7, a
#define ECCP1OD                          BANKMASK(ODCON1), 0, b
#define ECCP2AS0                         BANKMASK(ECCP2AS), 4, a
#define ECCP2AS1                         BANKMASK(ECCP2AS), 5, a
#define ECCP2AS2                         BANKMASK(ECCP2AS), 6, a
#define ECCP2ASE                         BANKMASK(ECCP2AS), 7, a
#define ECCP2OD                          BANKMASK(ODCON1), 1, b
#define EDG1POL                          BANKMASK(CTMUCONL), 4, a
#define EDG1SEL0                         BANKMASK(CTMUCONL), 2, a
#define EDG1SEL1                         BANKMASK(CTMUCONL), 3, a
#define EDG1STAT                         BANKMASK(CTMUCONL), 0, a
#define EDG2POL                          BANKMASK(CTMUCONL), 7, a
#define EDG2SEL0                         BANKMASK(CTMUCONL), 5, a
#define EDG2SEL1                         BANKMASK(CTMUCONL), 6, a
#define EDG2STAT                         BANKMASK(CTMUCONL), 1, a
#define EDGEN                            BANKMASK(CTMUCONH), 3, a
#define EDGSEQEN                         BANKMASK(CTMUCONH), 2, a
#define ENDP0                            BANKMASK(USTAT), 3, a
#define ENDP1                            BANKMASK(USTAT), 4, a
#define ENDP2                            BANKMASK(USTAT), 5, a
#define ENDP3                            BANKMASK(USTAT), 6, a
#define EP0CONDIS                        BANKMASK(UEP0), 3, b
#define EP0HSHK                          BANKMASK(UEP0), 4, b
#define EP0INEN                          BANKMASK(UEP0), 1, b
#define EP0OUTEN                         BANKMASK(UEP0), 2, b
#define EP0STALL                         BANKMASK(UEP0), 0, b
#define EP1CONDIS                        BANKMASK(UEP1), 3, b
#define EP1HSHK                          BANKMASK(UEP1), 4, b
#define EP1INEN                          BANKMASK(UEP1), 1, b
#define EP1OUTEN                         BANKMASK(UEP1), 2, b
#define EP1STALL                         BANKMASK(UEP1), 0, b
#define EP2CONDIS                        BANKMASK(UEP2), 3, b
#define EP2HSHK                          BANKMASK(UEP2), 4, b
#define EP2INEN                          BANKMASK(UEP2), 1, b
#define EP2OUTEN                         BANKMASK(UEP2), 2, b
#define EP2STALL                         BANKMASK(UEP2), 0, b
